Q1. List any five functions of the pandas library with execution.

Certainly! The pandas library is a popular data manipulation and analysis library for Python. Here are five commonly used functions along with their execution:

1. read_csv : This function is used to read data from a CSV file into a pandas DataFrame.

In [4]:
import pandas as pd
df = pd.read_csv('C:\Data Science\Files\data1.csv')
print(df)

      name   surname  gender  age    subject           email_id  phone_number
0    pooja     verma  female   21      maths    pooja@gmail.com      85798228
1   aanand     gupta    male   35    biology   aanand@gmail.com     628268865
2   dipika    maurya  female   25     Dfarma   dipika@gmail.com    6548652356
3   nikita  waghmare  female   32    nursing   nikita@gmail.com     978686183
4    anshu      shah    male   26  chemistry    anshu@gmail.com   78954685687
5   monika   gaikwad  female   21      maths   monika@gmail.com    9877857464
6    kajal     Singh  female   33         IT    kajal@gmail.com   66869746696
7   aaryan     verma    male   36      hindi   aaryan@gmail.com    6586865686
8  sanskar      modi    male   22        evs  sanskar@gmail.com   64585268365

2. head: The head function is used to display the first n rows of a DataFrame.

In [5]:
df.head()

     name   surname  gender  age    subject          email_id  phone_number
0   pooja     verma  female   21      maths   pooja@gmail.com      85798228
1  aanand     gupta    male   35    biology  aanand@gmail.com     628268865
2  dipika    maurya  female   25     Dfarma  dipika@gmail.com    6548652356
3  nikita  waghmare  female   32    nursing  nikita@gmail.com     978686183
4   anshu      shah    male   26  chemistry   anshu@gmail.com   78954685687

3. info: The info function provides a concise summary of a DataFrame, including the data types and the presence of missing values.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          9 non-null      object
 1   surname       9 non-null      object
 2   gender        9 non-null      object
 3   age           9 non-null      int64
 4   subject       9 non-null      object
 5   email_id      9 non-null      object
 6   phone_number  9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 636.0+ bytes

4. describe: The describe function generates descriptive statistics of the DataFrame, such as count, mean, min, and max.

In [7]:
df.describe()

             age  phone_number
count   9.000000  9.000000e+00
mean   27.888889  2.612398e+10
std     6.132790  3.339106e+10
min    21.000000  8.579823e+07
25%    22.000000  9.786862e+08
50%    26.000000  6.586866e+09
75%    33.000000  6.458527e+10
max    36.000000  7.895469e+10

5. groupby: The groupby function is used for grouping rows based on some criteria. It is often followed by an aggregation function.

In [8]:
g = df.groupby('gender')

In [13]:
g.mean('age')

          age  phone_number
gender
female  26.40  1.687215e+10
male    29.75  3.768877e+10

In [9]:
g.max()

           name   surname  age  subject           email_id  phone_number
gender
female    pooja  waghmare   33  nursing    pooja@gmail.com   66869746696
male    sanskar     verma   36    hindi  sanskar@gmail.com   78954685687

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [30]:
import pandas as pd
df1 = pd.DataFrame({
    'A': [1,2,3],
    'B': [4,5,6],
    'C': [7,8,9]})

In [31]:
index_list=[]
for i in range(1,len(df1)*2,2):
    index_list.append(i)

In [27]:
index_list

[1, 3, 5]

In [32]:
new_df = df1.set_index(pd.Index(index_list))

In [33]:
new_df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [64]:
df2 = pd.DataFrame(
    {
        'key1':[10,20,30,40,50],
        'key2':[5,10,15,20,25],
        'key3':[20,40,60,80,100],
        'key4':[15,30,45,60,75]
    }
)

In [65]:
df2

   key1  key2  key3  key4
0    10     5    20    15
1    20    10    40    30
2    30    15    60    45
3    40    20    80    60
4    50    25   100    75

In [75]:
df2.columns

Index(['key1', 'key2', 'key3', 'key4'], dtype='object')

In [77]:
for i in df2.columns:
    sum = df2[i].head(3).sum()
    print("sum of 1st 3 value of Column",i,"=",sum)

sum of 1st 3 value of Column key1 = 60
sum of 1st 3 value of Column key2 = 30
sum of 1st 3 value of Column key3 = 120
sum of 1st 3 value of Column key4 = 90

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [ ]:
df3 = pd.DataFrame(
    
)